/*！
 * 验证日期（年-月-日）(http://192.168.0.60:3000/showdoc-master/index.php?s=/23&page_id=193)
 * 1. 年-月-日  例如：2017-02-28
 * 2. 月只能是从1-12
 * 3. 日只能从1-31
 * 4. 匹配出二月份（28天或29天）
 *
 * Date：2017-03-13
 * Author：david_wang
 */
jQuery.validator.addMethod("isDate", function (value, element) {
	var reg = /^((((1[6-9]|[2-9]\d)\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\d|3[01]))|(((1[6-9]|[2-9]\d)\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\d|30))|(((1[6-9]|[2-9]\d)\d{2})-0?2-(0?[1-9]|1\d|2[0-8]))|(((1[6-9]|[2-9]\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29))$/;
	return this.optional(element) || (reg.test(value));
}, "请输入正确的日期，格式为年-月-日");