//
/*！
 * 验证完整日期（年-月-日 时:分:秒）(http://192.168.0.60:3000/showdoc-master/index.php?s=/23&page_id=195)
 * 1.年-月-日 时:分：秒
 * 2.月只能是从01-12
 * 2.日只能从01-31
 * 2.匹配出二月份（28天或29天）
 * 2.小时支持12小时制和24小时制
 * 2.分钟00-59
 * 2.秒00-59
 *
 * Date：2017-03-14
 * Author：haiyang
 */
jQuery.validator.addMethod("isFullDate", function(value, element) {
	var reg = /^((((1[6-9]|[2-9]\d)\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\d|3[01]))|(((1[6-9]|[2-9]\d)\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\d|30))|(((1[6-9]|[2-9]\d)\d{2})-0?2-(0?[1-9]|1\d|2[0-8]))|(((1[6-9]|[2-9]\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29)) (0\d|1\d|2[0-4]):([0|1|2|3|4|5]\d):([0|1|2|3|4|5]\d)$/;
	return this.optional(element) || (reg.test(value));
}, "请输入正确的时间，格式为年-月-日 时:分:秒");