/*！
* 验证车牌号(http://192.168.0.60:3000/showdoc-master/index.php?s=/23&page_id=197)
* 1、【常规车牌号】仅允许以汉字开头，后面可录入六个字符，由大写英文字母和阿拉伯数字组成。如：粤B12345
* 2、【最后一个为汉字的车牌】允许以汉字开头，后面可录入六个字符，前五位字符，由大写英文字母和阿拉伯数字组成，而最后一个字符为汉字，汉字包括“挂”、“学”、“警”、“港”、“澳”。如：粤Z1234港
* 3、【新军车牌】以两位为大写英文字母开头，后面以5位阿拉伯数字组成。如：BA12345。
* 4、【绿色车牌号（新能源车专用车牌）】2017年新车牌类型，仅允许以汉字开头，后面可录入七个字符，由大写英文字母和阿拉伯数字组成。如：粤B123456
* 
*
* Date：2017-03-13
* Author：haiyang
*/
jQuery.validator.addMethod("isVehicleNumber", function(value, element) {
	var reg = /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/;
	var reg2 =/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{6}$/;
	return this.optional(element) || (reg.test(value)) || reg2.test(value);
}, "请输入正确的车牌号");